init.org
#+STARTUP: showeverything

* Introduction

This is the Emacs environment I (Wilfred Hughes) use for development.

** Licensing

Code I've written (init.el and files under =user-lisp/=) is BSD
licensed, see [[file:COPYING][COPYING]].

** Reading This Document

This file is a literate programming document written with org-mode and
org-mode-babel. You can view init.html in a web browser, or read
init.org in Emacs.

You can edit any code block by putting point inside the block and
pressing =C-c '= (press =C-c '= again to escape).

** Generating This Document

init.org is the source file that I edit, and init.el and init.html are
generated from it. We define a convenience function to generate these files.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun wh/export-init-org ()
    "Generate init.html and init.html from the current init.org file."
    (interactive)
    (call-interactively #'org-babel-tangle)
    ;; Export as HTML 5, and include our styling overrides.
    (let ((org-html-doctype "html5")
          (org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"init.css\" />")
          (org-html-htmlize-output-type 'css))
      (call-interactively #'org-html-export-to-html)))
#+END_SRC

* Installing locally

This repository seeks to be as self-contained as possible. Generally,
you should be able to check out the repository and start using it on
any of Linux, OS X and Windows. To use this repository, you will
require:

** The Git Repository

Remove any existing .emacs.d configuration (or move elsewhere):

#+BEGIN_SRC sh
  rm -r ~/.emacs.d
#+END_SRC

Clone the repo:

#+BEGIN_SRC sh
  git clone git://github.com/Wilfred/.emacs.d.git
#+END_SRC

** Emacs 25

I use this repository with Emacs 25. Older Emacsen are used
occasionally, but will probably have bugs.

** Python

I use pyflakes, which is available on PyPI. You can install it with:

#+BEGIN_SRC sh
  sudo pip install pyflakes
#+END_SRC

** Less

I use lessc to check the syntax of =.less= files. You can install it
with:

#+BEGIN_SRC sh
  sudo npm install -g less
#+END_SRC

* Contents

** Folder Structure

Code I've written lives in user-lisp. This includes packages that I
haven't polished enough to release yet, small convenience functions,
and package customisations.

Interactive commands, configuration and keybindings are kept in files
named =FOO-customisations.el=. Elisp convenience functions are kept in
files named =FOO-utils.el=.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-to-list 'load-path "~/.emacs.d/user-lisp/")
#+END_SRC

Code that I haven't written lives in third-party-lisp. This directory
should ultimately disappear once all these packages live in [[http://melpa.milkbox.net/][MELPA]].

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-to-list 'load-path "~/.emacs.d/third-party-lisp/")
#+END_SRC

