init.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2016-12-26 Mon 18:19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="init.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga0af36a">1. Introduction</a>
<ul>
<li><a href="#org8733125">1.1. Licensing</a></li>
<li><a href="#org08b7910">1.2. Reading This Document</a></li>
<li><a href="#org2cdc773">1.3. Generating This Document</a></li>
</ul>
</li>
<li><a href="#org3c3b98d">2. Installing locally</a>
<ul>
<li><a href="#orgd2db74b">2.1. The Git Repository</a></li>
<li><a href="#org676762e">2.2. Emacs 25</a></li>
<li><a href="#org605e358">2.3. Python</a></li>
<li><a href="#org10e9d72">2.4. Less</a></li>
</ul>
</li>
<li><a href="#orgcb3c172">3. Contents</a>
<ul>
<li><a href="#org1fb852f">3.1. Folder Structure</a></li>
<li><a href="#org3de8df5">3.2. Packages</a></li>
<li><a href="#org9e7fb2b">3.3. UI</a>
<ul>
<li><a href="#orge6aba88">3.3.1. Theme</a></li>
<li><a href="#orgb8314e5">3.3.2. Visibility of UI Elements</a></li>
<li><a href="#org85df689">3.3.3. Recursive Editing</a></li>
</ul>
</li>
<li><a href="#org8cfb72a">3.4. Moving Around</a>
<ul>
<li><a href="#org4e05e5b">3.4.1. By Symbol</a></li>
<li><a href="#org7cf2cca">3.4.2. By indentation</a></li>
<li><a href="#org8cc23ea">3.4.3. By Character</a></li>
<li><a href="#orga1d7e85">3.4.4. Measuring Movement</a></li>
</ul>
</li>
<li><a href="#org6e62a2a">3.5. Inserting</a></li>
<li><a href="#org4b795f3">3.6. Killing</a></li>
<li><a href="#orgfdbef9e">3.7. Modifying and Editing</a>
<ul>
<li><a href="#org46de448">3.7.1. Matched Pairs</a></li>
</ul>
</li>
<li><a href="#org1dad7cf">3.8. Files</a>
<ul>
<li><a href="#orgc4ff404">3.8.1. Opening</a></li>
<li><a href="#org566ca30">3.8.2. Dired</a></li>
<li><a href="#org74d4bbd">3.8.3. Deleting and Backups</a></li>
<li><a href="#org1e27c81">3.8.4. Scratch Files</a></li>
</ul>
</li>
<li><a href="#org4801f1a">3.9. As-you-type Checks</a>
<ul>
<li><a href="#orgfdbb90f">3.9.1. Flymake</a></li>
<li><a href="#orgb878473">3.9.2. Flycheck</a></li>
</ul>
</li>
<li><a href="#org6938fe6">3.10. Undoing</a></li>
<li><a href="#orgb59735c">3.11. Emacs Lisp</a>
<ul>
<li><a href="#org1403773">3.11.1. Shortcuts</a></li>
<li><a href="#org616232c">3.11.2. Editing Parentheses</a></li>
<li><a href="#org2acd06d">3.11.3. Highlighting Parentheses</a></li>
<li><a href="#org3d13f56">3.11.4. Function Signatures</a></li>
<li><a href="#org45d147a">3.11.5. On-the-fly Checking</a></li>
<li><a href="#orgf8c0ef9">3.11.6. Highlighting</a></li>
</ul>
</li>
<li><a href="#org62c5a6d">3.12. Python</a></li>
<li><a href="#org732abbf">3.13. Haskell</a></li>
<li><a href="#org8fe5034">3.14. Ruby</a></li>
<li><a href="#orgeffb502">3.15. C/C++</a></li>
<li><a href="#orga6a532f">3.16. HTML</a></li>
<li><a href="#org4b1f8bb">3.17. CSS</a></li>
<li><a href="#orga429344">3.18. Less (CSS)</a></li>
<li><a href="#org0123582">3.19. Org-mode</a></li>
<li><a href="#org4be9d65">3.20. Markdown</a></li>
<li><a href="#orgd66e48c">3.21. Performance</a></li>
<li><a href="#orgab28e09">3.22. Shut Down</a></li>
<li><a href="#org7f8adb6">3.23. Workarounds</a></li>
<li><a href="#orgc435ba0">3.24. Undocumented</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga0af36a" class="outline-2">
<h2 id="orga0af36a"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the Emacs environment I (Wilfred Hughes) use for development.
</p>
</div>

<div id="outline-container-org8733125" class="outline-3">
<h3 id="org8733125"><span class="section-number-3">1.1</span> Licensing</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Code I've written (init.el and files under <code>user-lisp/</code>) is BSD
licensed, see <a href="COPYING">COPYING</a>.
</p>
</div>
</div>

<div id="outline-container-org08b7910" class="outline-3">
<h3 id="org08b7910"><span class="section-number-3">1.2</span> Reading This Document</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This file is a literate programming document written with org-mode and
org-mode-babel. You can view init.html in a web browser, or read
init.org in Emacs.
</p>

<p>
You can edit any code block by putting point inside the block and
pressing <code>C-c '</code> (press <code>C-c '</code> again to escape).
</p>
</div>
</div>

<div id="outline-container-org2cdc773" class="outline-3">
<h3 id="org2cdc773"><span class="section-number-3">1.3</span> Generating This Document</h3>
<div class="outline-text-3" id="text-1-3">
<p>
init.org is the source file that I edit, and init.el and init.html are
generated from it. We define a convenience function to generate these files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">wh/export-init-org</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Generate init.html and init.html from the current init.org file."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-tangle</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Export as HTML 5, and include our styling overrides.</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>org-html-doctype <span class="org-string">"html5"</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>org-html-head <span class="org-string">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"init.css\" /&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>org-html-htmlize-output-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-html-export-to-html</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c3b98d" class="outline-2">
<h2 id="org3c3b98d"><span class="section-number-2">2</span> Installing locally</h2>
<div class="outline-text-2" id="text-2">
<p>
This repository seeks to be as self-contained as possible. Generally,
you should be able to check out the repository and start using it on
any of Linux, OS X and Windows. To use this repository, you will
require:
</p>
</div>

<div id="outline-container-orgd2db74b" class="outline-3">
<h3 id="orgd2db74b"><span class="section-number-3">2.1</span> The Git Repository</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Remove any existing .emacs.d configuration (or move elsewhere):
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -r ~/.emacs.d
</pre>
</div>

<p>
Clone the repo:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone git://github.com/Wilfred/.emacs.d.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org676762e" class="outline-3">
<h3 id="org676762e"><span class="section-number-3">2.2</span> Emacs 25</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I use this repository with Emacs 25. Older Emacsen are used
occasionally, but will probably have bugs.
</p>
</div>
</div>

<div id="outline-container-org605e358" class="outline-3">
<h3 id="org605e358"><span class="section-number-3">2.3</span> Python</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I use pyflakes, which is available on PyPI. You can install it with:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pip install pyflakes
</pre>
</div>
</div>
</div>

<div id="outline-container-org10e9d72" class="outline-3">
<h3 id="org10e9d72"><span class="section-number-3">2.4</span> Less</h3>
<div class="outline-text-3" id="text-2-4">
<p>
I use lessc to check the syntax of <code>.less</code> files. You can install it
with:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo npm install -g less
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcb3c172" class="outline-2">
<h2 id="orgcb3c172"><span class="section-number-2">3</span> Contents</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org1fb852f" class="outline-3">
<h3 id="org1fb852f"><span class="section-number-3">3.1</span> Folder Structure</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Code I've written lives in user-lisp. This includes packages that I
haven't polished enough to release yet, small convenience functions,
and package customisations.
</p>

<p>
Interactive commands, configuration and keybindings are kept in files
named <code>FOO-customisations.el</code>. Elisp convenience functions are kept in
files named <code>FOO-utils.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/.emacs.d/user-lisp/"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Since init.el is generated from init.org, I don't want customize
writing to init.org. Define a separate file for customized variables
and faces:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> custom-file <span class="org-string">"~/.emacs.d/user-lisp/customized.el"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>load custom-file<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Code that I haven't written lives in third-party-lisp. This directory
should ultimately disappear once all these packages live in <a href="http://melpa.milkbox.net/">MELPA</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/.emacs.d/third-party-lisp/"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
