init.el
;; Generating This Document

;; init.org is the source file that I edit, and init.el and init.html are
;; generated from it. We define a convenience function to generate these files.


(defun wh/export-init-org ()
  "Generate init.html and init.html from the current init.org file."
  (interactive)
  (call-interactively #'org-babel-tangle)
  ;; Export as HTML 5, and include our styling overrides.
  (let ((org-html-doctype "html5")
        (org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"init.css\" />")
        (org-html-htmlize-output-type 'css))
    (call-interactively #'org-html-export-to-html)))

;; Folder Structure

;; Code I've written lives in user-lisp. This includes packages that I
;; haven't polished enough to release yet, small convenience functions,
;; and package customisations.

;; Interactive commands, configuration and keybindings are kept in files
;; named =FOO-customisations.el=. Elisp convenience functions are kept in
;; files named =FOO-utils.el=.


(add-to-list 'load-path "~/.emacs.d/user-lisp/")

(setq custom-file "~/.emacs.d/user-lisp/customized.el")
(load custom-file)



;; Code that I haven't written lives in third-party-lisp. This directory
;; should ultimately disappear once all these packages live in [[http://melpa.milkbox.net/][MELPA]].


(add-to-list 'load-path "~/.emacs.d/third-party-lisp/")

;; Packages
