init.org
** Packages

I use ELPA packages heavily for functionality, primarily the MELPA
repository. We initalize all the packages here, so we can use them
later.
  
#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'package)
  (setq package-archives
        '(("gnu" . "https://elpa.gnu.org/packages/")
          ("melpa" . "https://melpa.org/packages/")
          ("org" . "http://orgmode.org/elpa/")))

  (package-initialize)
#+END_SRC

** Paths

We set up Emacs' exec-path based on PATH in a shell. This is primarily
for OS X, where starting Emacs in GUI mode doesn't inherit the shell's
environment. This ensures that any command we can call from a shell,
we can call inside Emacs.

Note this function comes from the package =exec-path-from-shell=.
  
#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  ;; set exec-path according to the system's PATH
  (exec-path-from-shell-initialize)
#+END_SRC

** UI

*** Theme

I like the tangotango theme. It has very contrasting colours and uses
bold faces for definitions. It also has good support for a range of
popular packages.

TODO: I would also prefer zig-zag underlines for flycheck.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (load-theme 'tangotango t)
#+END_SRC

*** Visibility of UI Elements

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  ;; hide toolbar and scrollbar
  (tool-bar-mode 0)
  (scroll-bar-mode 0)
  
  ;; show x-position (ie column number) for point in buffer
  (column-number-mode 1)
#+END_SRC

*** Recursive Editing

We can make the minibuffer much more useful by enabling recursive
usage. This means that when the minibuffer is active we can still call
commands that require the minibuffer.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq enable-recursive-minibuffers t)
#+END_SRC
    
It's easy to lose track of whether we're in a recursive minibuffer or
not. We display the recursion level in the minibuffer to avoid confusion.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (minibuffer-depth-indicate-mode 1)
#+END_SRC

Occasionally, you end up with an active minibuffer that you didn't
want. ESC ESC ESC will close the minibuffer.

** Moving Around

C-v and M-v don't undo each other, because the point position isn't
preservered. Fix that.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq scroll-preserve-screen-position 'always)
#+END_SRC

