init.html

<div id="outline-container-org3de8df5" class="outline-3">
<h3 id="org3de8df5"><span class="section-number-3">3.2</span> Packages</h3>
<div class="outline-text-3" id="text-3-2">
<p>
I use ELPA packages heavily for functionality, primarily the MELPA
repository. We initalize all the packages here, so we can use them
later.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">package</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> package-archives
      <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"gnu"</span> . <span class="org-string">"https://elpa.gnu.org/packages/"</span><span class="org-rainbow-delimiters-depth-3">)</span>
        <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span><span class="org-rainbow-delimiters-depth-3">)</span>
        <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"org"</span> . <span class="org-string">"http://orgmode.org/elpa/"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>package-initialize<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e7fb2b" class="outline-3">
<h3 id="org9e7fb2b"><span class="section-number-3">3.3</span> UI</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-orge6aba88" class="outline-4">
<h4 id="orge6aba88"><span class="section-number-4">3.3.1</span> Theme</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
I like the tangotango theme. It has very contrasting colours and uses
bold faces for definitions. It also has good support for a range of
popular packages.
</p>

<p>
TODO: I would also prefer zig-zag underlines for flycheck.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>load-theme <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">tangotango</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8314e5" class="outline-4">
<h4 id="orgb8314e5"><span class="section-number-4">3.3.2</span> Visibility of UI Elements</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">hide toolbar and scrollbar</span>
<span class="org-rainbow-delimiters-depth-1">(</span>tool-bar-mode 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>scroll-bar-mode 0<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">show x-position (ie column number) for point in buffer</span>
<span class="org-rainbow-delimiters-depth-1">(</span>column-number-mode 1<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org85df689" class="outline-4">
<h4 id="org85df689"><span class="section-number-4">3.3.3</span> Recursive Editing</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
We can make the minibuffer much more useful by enabling recursive
usage. This means that when the minibuffer is active we can still call
commands that require the minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> enable-recursive-minibuffers t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
It's easy to lose track of whether we're in a recursive minibuffer or
not. We display the recursion level in the minibuffer to avoid confusion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>minibuffer-depth-indicate-mode 1<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Occasionally, you end up with an active minibuffer that you didn't
want. ESC ESC ESC will close the minibuffer.
</p>
</div>
</div>
</div>

<div id="outline-container-org8cfb72a" class="outline-3">
<h3 id="org8cfb72a"><span class="section-number-3">3.4</span> Moving Around</h3>
<div class="outline-text-3" id="text-3-4">
<p>
C-v and M-v don't undo each other, because the point position isn't
preservered. Fix that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> scroll-preserve-screen-position <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">always</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
