init.el

;; I use ELPA packages heavily for functionality, primarily the MELPA
;; repository. We initalize all the packages here, so we can use them
;; later.
  

(require 'package)
(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("melpa" . "https://melpa.org/packages/")
        ("org" . "http://orgmode.org/elpa/")))

(package-initialize)

;; Theme

;; I like the tangotango theme. It has very contrasting colours and uses
;; bold faces for definitions. It also has good support for a range of
;; popular packages.

;; TODO: I would also prefer zig-zag underlines for flycheck.


(load-theme 'tangotango t)

;; Visibility of UI Elements


;; hide toolbar and scrollbar
(tool-bar-mode 0)
(scroll-bar-mode 0)

;; show x-position (ie column number) for point in buffer
(column-number-mode 1)

;; Recursive Editing

;; We can make the minibuffer much more useful by enabling recursive
;; usage. This means that when the minibuffer is active we can still call
;; commands that require the minibuffer.


(setq enable-recursive-minibuffers t)


    
;; It's easy to lose track of whether we're in a recursive minibuffer or
;; not. We display the recursion level in the minibuffer to avoid confusion.


(minibuffer-depth-indicate-mode 1)

;; Moving Around

;; C-v and M-v don't undo each other, because the point position isn't
;; preservered. Fix that.


(setq scroll-preserve-screen-position 'always)

;; By Symbol
