init.org
*** By Symbol

It's extremely useful to be able to move between different occurrences
of the same symbol.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (define-key prog-mode-map (kbd "M-n") #'highlight-symbol-next)
  (define-key prog-mode-map (kbd "M-p") #'highlight-symbol-prev)

  ;; It's not clear to me why c++-mode-map isn't affected by prog-mode-map,
  ;; I suspect it's a bug (tested on 24.5).
  (require 'cc-mode)
  (define-key c++-mode-map (kbd "M-n") #'highlight-symbol-next)
  (define-key c++-mode-map (kbd "M-p") #'highlight-symbol-prev)
  (define-key c++-mode-map (kbd "M-N") #'highlight-symbol-last)
  (define-key c++-mode-map (kbd "M-P") #'highlight-symbol-first)
  (define-key c-mode-map (kbd "M-n") #'highlight-symbol-next)
  (define-key c-mode-map (kbd "M-p") #'highlight-symbol-prev)
  ;; Java-mode has the same problem.
  (define-key java-mode-map (kbd "M-n") #'highlight-symbol-next)
  (define-key java-mode-map (kbd "M-p") #'highlight-symbol-prev)
  ;; And groovy-mode (note these all inherit from cc-mode).
  (use-package groovy-mode
    :config
    (define-key groovy-mode-map (kbd "M-n") #'highlight-symbol-next)
    (define-key groovy-mode-map (kbd "M-p") #'highlight-symbol-prev))

  ;; Whilst YAML isn't a programming language, it's useful to move by
  ;; symbol here too.
  (require 'yaml-mode)
  (define-key yaml-mode-map (kbd "M-n") #'highlight-symbol-next)
  (define-key yaml-mode-map (kbd "M-p") #'highlight-symbol-prev)
#+END_SRC

Jumping to the first occurrence of the symbol is handy for finding
where a symbol was imported.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun highlight-symbol-first ()
    "Jump to the first location of symbol at point."
    (interactive)
    (push-mark)
    (eval
     `(progn
        (goto-char (point-min))
        (let ((case-fold-search nil))
          (search-forward-regexp
           (rx symbol-start ,(thing-at-point 'symbol) symbol-end)
           nil t))
        (beginning-of-thing 'symbol))))

  (define-key prog-mode-map (kbd "M-P") #'highlight-symbol-first)
#+END_SRC

More rarely, it's useful to be able to jump to the last occurrence of
a symbol.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun highlight-symbol-last ()
    "Jump to the last location of symbol at point."
    (interactive)
    (push-mark)
    (eval
     `(progn
        (goto-char (point-max))
        (let ((case-fold-search nil))
          (search-backward-regexp
           (rx symbol-start ,(thing-at-point 'symbol) symbol-end)
           nil t)))))

  (global-set-key (kbd "M-N") 'highlight-symbol-last)
#+END_SRC

