init.org
*** By indentation

[[elisp:(describe-key%20(kbd%20"C-a"))][C-a]] normally moves us to the beginning of the line unconditionally
with [[elisp:(describe-function%20#'move-beginning-of-line)][move-beginning-of-line]]. This version is more useful, as it moves
to the first non-whitespace character if we're already at the
beginning of the line. Repeated use of =C-a= toggles between these two
positions.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun beginning-of-line-dwim ()
    "Toggles between moving point to the first non-whitespace character, and
  the start of the line."
    (interactive)
    (let ((start-position (point)))
      ;; Move to the first non-whitespace character.
      (back-to-indentation)
      
      ;; If we haven't moved position, go to start of the line.
      (when (= (point) start-position)
        (move-beginning-of-line nil))))

  (global-set-key (kbd "C-a") 'beginning-of-line-dwim)
#+END_SRC
    
*** By Character

Vim has a handy command where you can type =f= to jump to the next
occurrence of a character on a line.

We can do this with ~jump-char~ without the constraint that the
character must be on the current line. This command needs to be
accessible with a short shortcut, so we use =M-m=. =M-m= is bound to
~back-to-indentation~ by default, but our =C-a= behaviour makes it
redundant.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'jump-char)

  (global-set-key (kbd "M-m") #'jump-char-forward)
  (global-set-key (kbd "M-M") #'jump-char-backward)
#+END_SRC

*** Measuring Movement

Since movement commands tend to be used more than any others, it's
useful to measure how much we use each command. This enables us to
look at frequent commands to see if we need to create custom commands
or different keybindings for common commands.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (keyfreq-mode 1)
  (keyfreq-autosave-mode 1)
#+END_SRC

** Inserting

It's often useful to start a new line of code that's above or below
the current line. This code is based on
http://emacsredux.com/blog/2013/03/26/smarter-open-line/ .

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'crux)

  (global-set-key (kbd "M-o") #'crux-smart-open-line)

  (global-set-key (kbd "M-O") #'crux-smart-open-line-above)
#+END_SRC

