init.html

<div id="outline-container-org7cf2cca" class="outline-4">
<h4 id="org7cf2cca"><span class="section-number-4">3.4.2</span> By indentation</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
<a href="(describe-key%20(kbd%20"C-a"))">C-a</a> normally moves us to the beginning of the line unconditionally
with <a href="(describe-function%20#'move-beginning-of-line)">move-beginning-of-line</a>. This version is more useful, as it moves
to the first non-whitespace character if we're already at the
beginning of the line. Repeated use of <code>C-a</code> toggles between these two
positions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">beginning-of-line-dwim</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Toggles between moving point to the first non-whitespace character, and</span>
<span class="org-doc">the start of the line."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>start-position <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Move to the first non-whitespace character.</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>back-to-indentation<span class="org-rainbow-delimiters-depth-3">)</span>

    <span class="org-comment-delimiter">;; </span><span class="org-comment">If we haven't moved position, go to start of the line.</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span>= <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span> start-position<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>move-beginning-of-line nil<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-a"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">beginning-of-line-dwim</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc23ea" class="outline-4">
<h4 id="org8cc23ea"><span class="section-number-4">3.4.3</span> By Character</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Vim has a handy command where you can type <code>f</code> to jump to the next
occurrence of a character on a line.
</p>

<p>
We can do this with <code>jump-char</code> without the constraint that the
character must be on the current line. This command needs to be
accessible with a short shortcut, so we use <code>M-m</code>. <code>M-m</code> is bound to
<code>back-to-indentation</code> by default, but our <code>C-a</code> behaviour makes it
redundant.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">jump-char</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-m"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">jump-char-forward</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-M"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">jump-char-backward</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1d7e85" class="outline-4">
<h4 id="orga1d7e85"><span class="section-number-4">3.4.4</span> Measuring Movement</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
Since movement commands tend to be used more than any others, it's
useful to measure how much we use each command. This enables us to
look at frequent commands to see if we need to create custom commands
or different keybindings for common commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>keyfreq-mode 1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>keyfreq-autosave-mode 1<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6e62a2a" class="outline-3">
<h3 id="org6e62a2a"><span class="section-number-3">3.5</span> Inserting</h3>
<div class="outline-text-3" id="text-3-5">
<p>
It's often useful to start a new line of code that's above or below
the current line. This code is based on
<a href="http://emacsredux.com/blog/2013/03/26/smarter-open-line/">http://emacsredux.com/blog/2013/03/26/smarter-open-line/</a> .
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">crux</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-o"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">crux-smart-open-line</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"M-O"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">crux-smart-open-line-above</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
