init.org
** Killing

It's handy to also delete the trailing newline when using [[elisp:(describe-key%20(kbd%20"C-k"))][C-k]].

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defadvice kill-line (around kill-line-remove-newline activate)
    (let ((kill-whole-line t))
      ad-do-it))
#+END_SRC

I sometimes want to simply delete a region, rather than
saving it to the kill-ring. I've added a function that allows me to
type =C-u C-w= to delete the region, whilst =C-w= works as normal.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun kill-or-delete-region (beg end prefix)
    "Delete the region, storing it in the kill-ring.
  If a prefix argument is given, don't change the kill-ring."
    (interactive "r\nP")
    (if prefix
        (delete-region beg end)
      (kill-region beg end)))
  
  (global-set-key (kbd "C-w") 'kill-or-delete-region)
  
#+END_SRC

** Modifying and Editing

Modifying text is fundamental to Emacs, and I use many utilites to
make life easier. Most of these are still in user-lisp/editing-customisations.el.

