init.html

<div id="outline-container-org4b795f3" class="outline-3">
<h3 id="org4b795f3"><span class="section-number-3">3.6</span> Killing</h3>
<div class="outline-text-3" id="text-3-6">
<p>
It's handy to also delete the trailing newline when using <a href="(describe-key%20(kbd%20"C-k"))">C-k</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defadvice</span> <span class="org-function-name">kill-line</span> <span class="org-rainbow-delimiters-depth-2">(</span>around kill-line-remove-newline activate<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>kill-whole-line t<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    ad-do-it<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
I sometimes want to simply delete a region, rather than
saving it to the kill-ring. I've added a function that allows me to
type <code>C-u C-w</code> to delete the region, whilst <code>C-w</code> works as normal.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">kill-or-delete-region</span> <span class="org-rainbow-delimiters-depth-2">(</span>beg end prefix<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Delete the region, storing it in the kill-ring.</span>
<span class="org-doc">If a prefix argument is given, don't change the kill-ring."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"r\nP"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> prefix
      <span class="org-rainbow-delimiters-depth-3">(</span>delete-region beg end<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>kill-region beg end<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-w"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-or-delete-region</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdbef9e" class="outline-3">
<h3 id="orgfdbef9e"><span class="section-number-3">3.7</span> Modifying and Editing</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Modifying text is fundamental to Emacs, and I use many utilites to
make life easier. Most of these are still in user-lisp/editing-customisations.el.
</p>
</div>
