init.el

;; Smartparens is an excellent way of editing pairs of brackets, quotes
;; etc. It's similar to paredit, but can be used in lisp, other
;; programming languages and even HTML.

;; Currently, I only use a few smartparens commands, using the same
;; keybindings as the equivalent paredit commands. You can view a list of all smartparens
;; commands with the command ~sp-cheat-sheet~.


(require 'smartparens)

;; (foo bar) -> foo bar
(define-key smartparens-mode-map (kbd "M-s") 'sp-splice-sexp)

;; (foo bar) -> [foo bar]
(define-key smartparens-mode-map (kbd "M-S") 'sp-rewrap-sexp)

;; (|foo) bar -> (|foo bar)
(define-key smartparens-mode-map (kbd "<C-right>") 'sp-slurp-hybrid-sexp)

;; (|foo bar) -> (|foo) bar
(define-key smartparens-mode-map (kbd "<C-left>") #'sp-forward-barf-sexp)

;; foo(1, |[2, 3], 4) -> foo(1, |, 2)
(define-key smartparens-mode-map (kbd "C-M-k") #'sp-kill-sexp)
(define-key smartparens-mode-map (kbd "s-k") #'sp-kill-sexp)

(defun wh/smartparens-wrap-round (arg)
  "Smartparens equivalent of `paredit-wrap-round'."
  (interactive "P")
  (sp-wrap-with-pair "("))

(define-key smartparens-mode-map (kbd "M-(") #'wh/smartparens-wrap-round)

(defun wh/smartparens-wrap-square-bracket (arg)
  "[] equivalent of `wh/smartparens-wrap-round'."
  (interactive "P")
  (sp-wrap-with-pair "["))

(define-key smartparens-mode-map (kbd "M-[") #'wh/smartparens-wrap-square-bracket)

(defun wh/smartparens-wrap-curly-paren (arg)
  "{} equivalent of `wh/smartparens-wrap-round'."
  (interactive "P")
  (sp-wrap-with-pair "{"))

(define-key smartparens-mode-map (kbd "M-{") #'wh/smartparens-wrap-curly-paren)

(defun wh/smartparens-wrap-singlequote (arg)
  "As `wh/smartparens-wrap-round' but for wrapping with single quotes."
  (interactive "P")
  (sp-wrap-with-pair "'"))

(define-key smartparens-mode-map (kbd "M-'") #'wh/smartparens-wrap-singlequote)

(define-key smartparens-mode-map (kbd "s-f") #'sp-forward-sexp)
(define-key smartparens-mode-map (kbd "s-b") #'sp-backward-sexp)

(define-key smartparens-mode-map (kbd "s-u") #'sp-backward-up-sexp)



;; I like to use smartparens in all programming modes.

;; Smartparens strict mode ensures parens always stay balanced when
;; editing. For example, given code of the form =foo(1, |bar())=, C-k
;; produces =foo(1, |)=.


(require 'smartparens-config)
(require 'smartparens-html)
(add-hook 'prog-mode-hook #'smartparens-strict-mode)



;; Outside of programming, strict mode is more easily confused, so I
;; prefer normal smartparens-mode.


(add-hook 'yaml-mode-hook #'smartparens-mode)
(add-hook 'sqlplus-mode-hook #'smartparens-mode)

;; Opening
