init.html

<div id="outline-container-org1dad7cf" class="outline-3">
<h3 id="org1dad7cf"><span class="section-number-3">3.8</span> Files</h3>
<div class="outline-text-3" id="text-3-8">
</div><div id="outline-container-orgc4ff404" class="outline-4">
<h4 id="orgc4ff404"><span class="section-number-4">3.8.1</span> Opening</h4>
<div class="outline-text-4" id="text-3-8-1">
<p>
It's useful to be able to quickly open files that we opened before. We
load and configure a function for this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">recentf</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">offer recently accessed files from the menu</span>
<span class="org-rainbow-delimiters-depth-1">(</span>recentf-mode t<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">remember this many files</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> recentf-max-saved-items 500<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">from http://www.masteringemacs.org/article/find-files-faster-recent-files-package</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">crux</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We bind this to <code>C-x C-r</code> (mnemonic: recent). By default, <code>C-x C-r</code> is bound to
<code>find-file-read-only</code>, which isn't very useful. (You can set any file
as read only with <code>read-only-mode</code>, mapped to <code>C-x C-q</code>.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x C-r"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">crux-recentf-ido-find-file</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Most of the time though, it's helpful to be able to pick a file in the
same source code repository as the current buffer. There are several
tools to do this. I've played with <code>find-file-in-repository</code>,
<code>projectile</code> and <code>find-file-in-project</code>.
</p>

<p>
<code>find-file-in-project</code> seems unmaintained. <code>find-file-in-repository</code>
is fast and works well, but is only lightly maintained and doesn't
support some version control systems. <code>projectile</code> is fast enough,
actively maintained and featureful.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">projectile</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>projectile-global-mode<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We bind <code>projectile-find-file</code> to <code>C-x C-g</code>, as we use it
a lot and it's right next to <code>C-x C-f</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x C-g"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">projectile-find-file</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Don't bother showing projectile in the minibuffer, I have enough in
there already.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>diminish <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">projectile-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org566ca30" class="outline-4">
<h4 id="org566ca30"><span class="section-number-4">3.8.2</span> Dired</h4>
<div class="outline-text-4" id="text-3-8-2">
<p>
Dired isn't very colourful by default, but <code>dired+</code> has helpful
highlighting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">dired+</span>
  <span class="org-builtin">:init</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> diredp-hide-details-initially-flag nil<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org74d4bbd" class="outline-4">
<h4 id="org74d4bbd"><span class="section-number-4">3.8.3</span> Deleting and Backups</h4>
<div class="outline-text-4" id="text-3-8-3">
<p>
When we delete a file, it should go to the recycle bin rather than
just acting like <a href="rm">rm</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> delete-by-moving-to-trash t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Emacs' backup behaviour is helpful, so we increase the number of
backups. However, rather than writing <code>foo~1~</code> files everywhere, we
store all our backups in <code>~/.saves</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span>
   backup-by-copying t      <span class="org-comment-delimiter">; </span><span class="org-comment">don't clobber symlinks</span>
   backup-directory-alist
    <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"."</span> . <span class="org-string">"~/.saves"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>    <span class="org-comment-delimiter">; </span><span class="org-comment">don't litter my fs tree</span>
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t<span class="org-rainbow-delimiters-depth-1">)</span>       <span class="org-comment-delimiter">; </span><span class="org-comment">use versioned backups</span>
</pre>
</div>

<p>
However, Emacs isn't aggressive enough with backups. We use
<code>backup-each-save</code> to ensure we have a copy of state of every file
we've modified.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">backup-each-save</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">after-save-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">backup-each-save</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
