init.el

;; It's useful to be able to quickly open files that we opened before. We
;; load and configure a function for this:


(require 'recentf)

;; offer recently accessed files from the menu
(recentf-mode t)

;; remember this many files
(setq recentf-max-saved-items 500)

;; from http://www.masteringemacs.org/article/find-files-faster-recent-files-package
(require 'crux)



;; We bind this to =C-x C-r= (mnemonic: recent). By default, =C-x C-r= is bound to
;; ~find-file-read-only~, which isn't very useful. (You can set any file
;; as read only with ~read-only-mode~, mapped to =C-x C-q=.)


(global-set-key (kbd "C-x C-r") #'crux-recentf-ido-find-file)



;; Most of the time though, it's helpful to be able to pick a file in the
;; same source code repository as the current buffer. There are several
;; tools to do this. I've played with ~find-file-in-repository~,
;; ~projectile~ and ~find-file-in-project~.

;; ~find-file-in-project~ seems unmaintained. ~find-file-in-repository~
;; is fast and works well, but is only lightly maintained and doesn't
;; support some version control systems. ~projectile~ is fast enough,
;; actively maintained and featureful.


(require 'projectile)
(projectile-global-mode)



;; We bind ~projectile-find-file~ to =C-x C-g=, as we use it
;; a lot and it's right next to =C-x C-f=.


(global-set-key (kbd "C-x C-g") 'projectile-find-file)

;; Dired

;; Dired isn't very colourful by default, but ~dired+~ has helpful
;; highlighting.


(use-package dired+
  :init
  (setq diredp-hide-details-initially-flag nil))

;; Deleting and Backups

;; When we delete a file, it should go to the recycle bin rather than
;; just acting like shell:rm.


(setq delete-by-moving-to-trash t)



;; Emacs' backup behaviour is helpful, so we increase the number of
;; backups. However, rather than writing =foo~1~= files everywhere, we
;; store all our backups in =~/.saves=.


(setq
   backup-by-copying t      ; don't clobber symlinks
   backup-directory-alist
    '(("." . "~/.saves"))    ; don't litter my fs tree
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t)       ; use versioned backups



;; However, Emacs isn't aggressive enough with backups. We use
;; ~backup-each-save~ to ensure we have a copy of state of every file
;; we've modified.


(require 'backup-each-save)
(add-hook 'after-save-hook 'backup-each-save)

;; Scratch Files
