init.org
*** Scratch Files

It's often useful to create a throwaway file to write a minimal
testcase for some language or library feature.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun start--file (path)
    "Create a file at PATH, creating any containing directories as necessary.
  Visit the file after creation."
    (make-directory (file-name-directory path) t)
    (find-file path))

  (defun wh/start-scratch-file (file-name)
    "Create a file in ~/scratch for the given file name."
    (interactive "sName of scratch file: ")
    (start--file (expand-file-name (format "~/scratch/%s" file-name))))

  (defun wh/start-tmp-file (file-name)
    "Create a file in /tmp for the given file name."
    (interactive "sName of temporary file: ")
    (start--file (expand-file-name (format "/tmp/%s" file-name))))
#+END_SRC

It's also useful to quickly generate a minimal HTML page to play with.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun wh/start-scratch-html-file (file-name)
    "Create a test HTML file in ~/scratch to play around with."
    (interactive "sName of scratch HTML file: ")
    (wh/start-scratch-file file-name)
    (erase-buffer)
    (insert "<!DOCTYPE html>
  <html>
      <head>
          <meta http-equiv=\"Content-Type\" content=\"text/html; charset=UTF-8\">
          <title>
          </title>
          <style type=\"text/css\">
          </style>
      </head>
      <body>
  
      </body>
  </html>")
    (forward-line -2)
    (move-end-of-line nil))
#+END_SRC

** As-you-type Checks

