init.html

<div id="outline-container-org1e27c81" class="outline-4">
<h4 id="org1e27c81"><span class="section-number-4">3.8.4</span> Scratch Files</h4>
<div class="outline-text-4" id="text-3-8-4">
<p>
It's often useful to create a throwaway file to write a minimal
testcase for some language or library feature.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">start--file</span> <span class="org-rainbow-delimiters-depth-2">(</span>path<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Create a file at PATH, creating any containing directories as necessary.</span>
<span class="org-doc">Visit the file after creation."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>make-directory <span class="org-rainbow-delimiters-depth-3">(</span>file-name-directory path<span class="org-rainbow-delimiters-depth-3">)</span> t<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>find-file path<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">wh/start-scratch-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>file-name<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Create a file in ~/scratch for the given file name."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"sName of scratch file: "</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>start--file <span class="org-rainbow-delimiters-depth-3">(</span>expand-file-name <span class="org-rainbow-delimiters-depth-4">(</span>format <span class="org-string">"~/scratch/%s"</span> file-name<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">wh/start-tmp-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>file-name<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Create a file in /tmp for the given file name."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"sName of temporary file: "</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>start--file <span class="org-rainbow-delimiters-depth-3">(</span>expand-file-name <span class="org-rainbow-delimiters-depth-4">(</span>format <span class="org-string">"/tmp/%s"</span> file-name<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
It's also useful to quickly generate a minimal HTML page to play with.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">wh/start-scratch-html-file</span> <span class="org-rainbow-delimiters-depth-2">(</span>file-name<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Create a test HTML file in ~/scratch to play around with."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"sName of scratch HTML file: "</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>wh/start-scratch-file file-name<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>erase-buffer<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>insert <span class="org-string">"&lt;!DOCTYPE html&gt;</span>
<span class="org-string">&lt;html&gt;</span>
<span class="org-string">    &lt;head&gt;</span>
<span class="org-string">        &lt;meta http-equiv=\"Content-Type\" content=\"text/html; charset=UTF-8\"&gt;</span>
<span class="org-string">        &lt;title&gt;</span>
<span class="org-string">        &lt;/title&gt;</span>
<span class="org-string">        &lt;style type=\"text/css\"&gt;</span>
<span class="org-string">        &lt;/style&gt;</span>
<span class="org-string">    &lt;/head&gt;</span>
<span class="org-string">    &lt;body&gt;</span>

<span class="org-string">    &lt;/body&gt;</span>
<span class="org-string">&lt;/html&gt;"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>forward-line -2<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>move-end-of-line nil<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4801f1a" class="outline-3">
<h3 id="org4801f1a"><span class="section-number-3">3.9</span> As-you-type Checks</h3>
