init.org
*** Flymake

(Note that there's language-specific flymake configuration too.)

It's really useful to be able to move between flymake errors, so we
bind =F8= and =F9= for this. Since there's a gap between these two
keys, they're easy to find.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'flymake)
  (global-set-key (kbd "<f8>") 'flymake-goto-prev-error)
  (global-set-key (kbd "<f9>") 'flymake-goto-next-error)
#+END_SRC

When the cursor (point) is on a line, we want to show the error on
that line in the minibuffer.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (defun flymake-error-at-point ()
    "Show the flymake error in the minibuffer when point is on an invalid line."
    (when (get-char-property (point) 'flymake-overlay)
      (let ((help (get-char-property (point) 'help-echo)))
        (if help (message "%s" help)))))
  
  (add-hook 'post-command-hook 'flymake-error-at-point)
#+END_SRC

I prefer my errors underlined.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (custom-set-faces
   '(flymake-errline ((((class color)) (:underline "Red"))))
   '(flymake-warnline ((((class color)) (:underline "Orange")))))
#+END_SRC

