init.org
*** Shortcuts

=eval-defun= is bound to =C-M-x=, but Gnome doesn't allow Emacs to
receive that key sequence. When writing elisp, it's very useful, so we
bind it to a convenient keybinding.

=edebug-eval-defun= is even more powerful. It ensures that =defvar=
and =defcustom= are re-evaluated, so they're reset to their initial
values. It can even mark a function for edebug, if it's called with a
prefix.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'edebug)
  (define-key emacs-lisp-mode-map (kbd "C-c e") #'edebug-eval-defun)
#+END_SRC

Similarly, toggle-debug-on-error is something I call a lot when
developing, and it doesn't have have any keybinding.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (define-key emacs-lisp-mode-map (kbd "C-c d") 'toggle-debug-on-error)
#+END_SRC

When writing and debugging macros, it's really important to be able
to see what they expand to. Macrostep allows us to incrementally
expand the macros in our elisp file.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (define-key emacs-lisp-mode-map (kbd "C-c m") 'macrostep-expand)
#+END_SRC

*** Editing Parentheses

Paredit make editing code with parentheses wonderful and has been the
gold standard for lisp coding for some time. Smartparens has recently
gained popularity as an paredit alternative, but I haven't invested
the time to set it up for lisp yet.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'emacs-lisp-mode-hook
            (lambda () (paredit-mode 1)))
#+END_SRC

*** Highlighting Parentheses

We colour each pair of parentheses according to their depth. This is
useful for seeing similarly nested lines, such as conditions in a
cond expression.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
#+END_SRC

Our theme (tangotango) only provides colours for the first few nesting
levels before repeating. We override the face colours so we have
unique colours until we're seven levels deep.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'rainbow-delimiters)
  (set-face-foreground 'rainbow-delimiters-depth-1-face "white")
  (set-face-foreground 'rainbow-delimiters-depth-2-face "cyan")
  (set-face-foreground 'rainbow-delimiters-depth-3-face "yellow")
  (set-face-foreground 'rainbow-delimiters-depth-4-face "green")
  (set-face-foreground 'rainbow-delimiters-depth-5-face "orange")
  (set-face-foreground 'rainbow-delimiters-depth-6-face "purple")
  (set-face-foreground 'rainbow-delimiters-depth-7-face "white")
  (set-face-foreground 'rainbow-delimiters-depth-8-face "cyan")
  (set-face-foreground 'rainbow-delimiters-depth-9-face "yellow")
  (set-face-foreground 'rainbow-delimiters-unmatched-face "red")
#+END_SRC

*** Function Signatures

We use eldoc to show the signature of the function at point in the
minibuffer.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
#+END_SRC

We don't want this minor mode to be shown in the minibuffer, however.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'diminish)
  (require 'eldoc)
  (diminish 'eldoc-mode)
#+END_SRC

