init.html

<div id="outline-container-orgb59735c" class="outline-3">
<h3 id="orgb59735c"><span class="section-number-3">3.11</span> Emacs Lisp</h3>
<div class="outline-text-3" id="text-3-11">
</div><div id="outline-container-org1403773" class="outline-4">
<h4 id="org1403773"><span class="section-number-4">3.11.1</span> Shortcuts</h4>
<div class="outline-text-4" id="text-3-11-1">
<p>
<code>eval-defun</code> is bound to <code>C-M-x</code>, but Gnome doesn't allow Emacs to
receive that key sequence. When writing elisp, it's very useful, so we
bind it to a convenient keybinding.
</p>

<p>
<code>edebug-eval-defun</code> is even more powerful. It ensures that <code>defvar</code>
and <code>defcustom</code> are re-evaluated, so they're reset to their initial
values. It can even mark a function for edebug, if it's called with a
prefix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">edebug</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key emacs-lisp-mode-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-c e"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">edebug-eval-defun</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Similarly, toggle-debug-on-error is something I call a lot when
developing, and it doesn't have have any keybinding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key emacs-lisp-mode-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-c d"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">toggle-debug-on-error</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
When writing and debugging macros, it's really important to be able
to see what they expand to. Macrostep allows us to incrementally
expand the macros in our elisp file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>define-key emacs-lisp-mode-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-c m"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">macrostep-expand</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org616232c" class="outline-4">
<h4 id="org616232c"><span class="section-number-4">3.11.2</span> Editing Parentheses</h4>
<div class="outline-text-4" id="text-3-11-2">
<p>
Paredit make editing code with parentheses wonderful and has been the
gold standard for lisp coding for some time. Smartparens has recently
gained popularity as an paredit alternative, but I haven't invested
the time to set it up for lisp yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-mode-hook</span>
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span>paredit-mode 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2acd06d" class="outline-4">
<h4 id="org2acd06d"><span class="section-number-4">3.11.3</span> Highlighting Parentheses</h4>
<div class="outline-text-4" id="text-3-11-3">
<p>
We colour each pair of parentheses according to their depth. This is
useful for seeing similarly nested lines, such as conditions in a
cond expression.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Our theme (tangotango) only provides colours for the first few nesting
levels before repeating. We override the face colours so we have
unique colours until we're seven levels deep.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">rainbow-delimiters</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-1-face</span> <span class="org-string">"white"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-2-face</span> <span class="org-string">"cyan"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-3-face</span> <span class="org-string">"yellow"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-4-face</span> <span class="org-string">"green"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-5-face</span> <span class="org-string">"orange"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-6-face</span> <span class="org-string">"purple"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-7-face</span> <span class="org-string">"white"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-8-face</span> <span class="org-string">"cyan"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-depth-9-face</span> <span class="org-string">"yellow"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-delimiters-unmatched-face</span> <span class="org-string">"red"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d13f56" class="outline-4">
<h4 id="org3d13f56"><span class="section-number-4">3.11.4</span> Function Signatures</h4>
<div class="outline-text-4" id="text-3-11-4">
<p>
We use eldoc to show the signature of the function at point in the
minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eldoc-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We don't want this minor mode to be shown in the minibuffer, however.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">diminish</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">eldoc</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eldoc-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
