init.org
*** On-the-fly Checking

It's really useful to use flycheck when coding elisp. It detects
mistyped variables, deprecated functions (everything that
byte-compilation checks).

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
(add-hook 'emacs-lisp-mode-hook 'flycheck-mode)
#+END_SRC

By default, flycheck also runs checkdoc on elisp code. This gets in
the way for quick throwaway elisp scripts, so we switch off checkdoc.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'flycheck)
  (setq flycheck-checkers (--remove (eq it 'emacs-lisp-checkdoc) flycheck-checkers))
#+END_SRC

*** Highlighting

Emacs lisp highlighting works pretty well out of the box. However,
dash.el provides addition highlighting for its functions and variables
used in its anaphoric macros (e.g. ~it~).

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (eval-after-load "dash" '(dash-enable-font-lock))
#+END_SRC

** Python

We use pyflakes with flycheck to check for coding errors. Flycheck
includes other Python checkers so we also disable those.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'flycheck-pyflakes)
  (add-hook 'python-mode-hook 'flycheck-mode)

  (add-hook 'python-mode-hook
            (lambda ()
              (add-to-list 'flycheck-disabled-checkers 'python-flake8)
              (add-to-list 'flycheck-disabled-checkers 'python-pylint)))
#+END_SRC

I like to write docstrings with example usage. These examples aren't
always valid doctests, so we switch off doctest checks.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setenv "PYFLAKES_NODOCTEST" "y")
#+END_SRC

I often write triple-quoted docstrings, so it's convenient to have a
shortcut for inserting them.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'python)

  (define-skeleton python-insert-docstring
    "Insert a Python docstring."
    "This string is ignored!"
    "\"\"\"" - "\n\n    \"\"\"")

  (define-key python-mode-map (kbd "C-c s") 'python-insert-docstring)
#+END_SRC

** Haskell

Flycheck supports Haskell well, so we switch it on inside Haskell
buffers.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'haskell-mode-hook 'flycheck-mode)
#+END_SRC

Tab doesn't indent in haskell-mode by default, so we enable
indentation.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
#+END_SRC

** Ruby

Vagrant files are Ruby, so use Ruby syntax highlighting for them.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-to-list 'auto-mode-alist '("Vagrantfile" . ruby-mode))
#+END_SRC

** C/C++

Flycheck supports C, so we switch it on.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'c-mode-common-hook #'flycheck-mode)
#+END_SRC

Always indent with 4 spaces, in the Linux kernel style.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq-default c-default-style "linux"
                c-basic-offset 4)
#+END_SRC

Hungry delete is useful in C (i.e. remove up to the next
non-whitespace character on C-d) when removing indentation.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq-default c-hungry-delete-key t)
#+END_SRC

