init.html

<div id="outline-container-org45d147a" class="outline-4">
<h4 id="org45d147a"><span class="section-number-4">3.11.5</span> On-the-fly Checking</h4>
<div class="outline-text-4" id="text-3-11-5">
<p>
It's really useful to use flycheck when coding elisp. It detects
mistyped variables, deprecated functions (everything that
byte-compilation checks).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
By default, flycheck also runs checkdoc on elisp code. This gets in
the way for quick throwaway elisp scripts, so we switch off checkdoc.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">flycheck</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> flycheck-checkers <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">--remove</span> <span class="org-rainbow-delimiters-depth-3">(</span>eq <span class="org-variable-name">it</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-checkdoc</span><span class="org-rainbow-delimiters-depth-3">)</span> flycheck-checkers<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8c0ef9" class="outline-4">
<h4 id="orgf8c0ef9"><span class="section-number-4">3.11.6</span> Highlighting</h4>
<div class="outline-text-4" id="text-3-11-6">
<p>
Emacs lisp highlighting works pretty well out of the box. However,
dash.el provides addition highlighting for its functions and variables
used in its anaphoric macros (e.g. <code>it</code>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>eval-after-load <span class="org-string">"dash"</span> <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span>dash-enable-font-lock<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org62c5a6d" class="outline-3">
<h3 id="org62c5a6d"><span class="section-number-3">3.12</span> Python</h3>
<div class="outline-text-3" id="text-3-12">
<p>
We use pyflakes with flycheck to check for coding errors. Flycheck
includes other Python checkers so we also disable those.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">flycheck-pyflakes</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-mode-hook</span>
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-disabled-checkers</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-flake8</span><span class="org-rainbow-delimiters-depth-3">)</span>
            <span class="org-rainbow-delimiters-depth-3">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-disabled-checkers</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-pylint</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
I like to write docstrings with example usage. These examples aren't
always valid doctests, so we switch off doctest checks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setenv <span class="org-string">"PYFLAKES_NODOCTEST"</span> <span class="org-string">"y"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
I often write triple-quoted docstrings, so it's convenient to have a
shortcut for inserting them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">python</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">python-insert-docstring</span>
  <span class="org-doc">"Insert a Python docstring."</span>
  <span class="org-string">"This string is ignored!"</span>
  <span class="org-string">"\"\"\""</span> - <span class="org-string">"\n\n    \"\"\""</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>define-key python-mode-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-c s"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-insert-docstring</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org732abbf" class="outline-3">
<h3 id="org732abbf"><span class="section-number-3">3.13</span> Haskell</h3>
<div class="outline-text-3" id="text-3-13">
<p>
Flycheck supports Haskell well, so we switch it on inside Haskell
buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">haskell-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Tab doesn't indent in haskell-mode by default, so we enable
indentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">haskell-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">turn-on-haskell-indentation</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fe5034" class="outline-3">
<h3 id="org8fe5034"><span class="section-number-3">3.14</span> Ruby</h3>
<div class="outline-text-3" id="text-3-14">
<p>
Vagrant files are Ruby, so use Ruby syntax highlighting for them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Vagrantfile"</span> . ruby-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeffb502" class="outline-3">
<h3 id="orgeffb502"><span class="section-number-3">3.15</span> C/C++</h3>
<div class="outline-text-3" id="text-3-15">
<p>
Flycheck supports C, so we switch it on.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">c-mode-common-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">flycheck-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Always indent with 4 spaces, in the Linux kernel style.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> c-default-style <span class="org-string">"linux"</span>
              c-basic-offset 4<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Hungry delete is useful in C (i.e. remove up to the next
non-whitespace character on C-d) when removing indentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq-default</span> c-hungry-delete-key t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
