init.html

<div id="outline-container-orga6a532f" class="outline-3">
<h3 id="orga6a532f"><span class="section-number-3">3.16</span> HTML</h3>
<div class="outline-text-3" id="text-3-16">
<p>
I like to indent my HTML with tabs (company policy at the first web
shop I worked at).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">sgml-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">; </span><span class="org-comment">indent html with tabs only</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">html-mode-hook</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">function</span>
   <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-4">()</span>
     <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">progn</span>
       <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> indent-tabs-mode nil<span class="org-rainbow-delimiters-depth-5">)</span>
       <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> sgml-basic-offset 4<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Automatically close &lt; and " character inside HTML using smartparens.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">smartparens-config</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">html-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">smartparens-strict-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Much of my HTML is for Django templates. These sometimes have .dtml
filenames, so use html-mode for those files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\\.dtml$"</span> . html-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We want syntax highlighting for Django template syntax, so add extra
font faces and use them if we see Django syntax.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Define coloured faces for Django syntax.</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">django-tag-face</span> <span class="org-rainbow-delimiters-depth-2">(</span>make-face <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-tag-face</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-tag-face</span> <span class="org-string">"Orange"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">django-variable-face</span> <span class="org-rainbow-delimiters-depth-2">(</span>make-face <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-variable-face</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-variable-face</span> <span class="org-string">"Green"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">django-comment-face</span> <span class="org-rainbow-delimiters-depth-2">(</span>make-face <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-comment-face</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>set-face-foreground <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">django-comment-face</span> <span class="org-string">"Gray"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use these faces for Django syntax.  </span>
<span class="org-rainbow-delimiters-depth-1">(</span>font-lock-add-keywords
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">html-mode</span>
 <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span>
   <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">{%[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">%]*%}</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> 1 django-tag-face prepend<span class="org-rainbow-delimiters-depth-3">)</span>
   <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">{{[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">}]*}}</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> 1 django-variable-face prepend<span class="org-rainbow-delimiters-depth-3">)</span>
   <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">{#[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">}]*#}</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> 1 django-comment-face prepend<span class="org-rainbow-delimiters-depth-3">)</span>
   <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">{% comment %}</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span>
<span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">*{% endcomment %}</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> 1 django-comment-face prepend<span class="org-rainbow-delimiters-depth-3">)</span>
   <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
TODO: document the rest of our HTML configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">; </span><span class="org-comment">skeletons for Django template tags</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-tag-skeleton</span>
  <span class="org-doc">"Insert a {% foo %} template tag"</span>
  <span class="org-string">"Template tag name: "</span>
  <span class="org-string">"{% "</span> str <span class="org-string">" %}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-variable-skeleton</span>
  <span class="org-doc">"Insert a {{ foo }} template variable"</span>
  <span class="org-string">"Template variable: "</span>
  <span class="org-string">"{{ "</span> str <span class="org-string">" }}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-comment-skeleton</span>
  <span class="org-doc">"Insert a {# foo #} template variable"</span>
  <span class="org-string">"Comment: "</span>
  <span class="org-string">"{# "</span> str <span class="org-string">" #}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-block-skeleton</span>
  <span class="org-doc">"Insert {% block foo %}{% endblock %}"</span>
  <span class="org-string">"Block name: "</span>
  <span class="org-string">"{% block "</span> str <span class="org-string">" %}\n"</span> - <span class="org-string">"\n{% endblock %}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-if-else-skeleton</span>
  <span class="org-doc">"Insert {% if foo %}{% else %}{% endif %}"</span>
  <span class="org-string">"If condition: "</span>
  <span class="org-string">"{% if "</span> str <span class="org-string">" %}\n"</span> - <span class="org-string">"\n{% else %}\n\n{% endif %}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">template-if-skeleton</span>
  <span class="org-doc">"Insert {% if foo %}{% endif %}"</span>
  <span class="org-string">"If condition: "</span>
  <span class="org-string">"{% if "</span> str <span class="org-string">" %}"</span> - <span class="org-string">"{% endif %}"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define-skeleton</span> <span class="org-function-name">underscore-skeleton</span>
  <span class="org-doc">"Insert &lt;%= foo %&gt;"</span>
  <span class="org-string">"Contents: "</span>
  <span class="org-string">"&lt;%= "</span> str <span class="org-string">" %&gt;"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">template-skeletons</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-rainbow-delimiters-depth-2">(</span>template-tag-skeleton
    template-variable-skeleton
    template-comment-skeleton
    template-block-skeleton
    template-if-skeleton
    template-if-else-skeleton
    underscore-skeleton<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">insert-django-skeleton</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>skeleton-names <span class="org-rainbow-delimiters-depth-5">(</span>mapcar <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">symbol-name</span> template-skeletons<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>skeleton-chosen <span class="org-rainbow-delimiters-depth-5">(</span>ido-completing-read <span class="org-string">"HTML skeleton: "</span> skeleton-names<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>funcall <span class="org-rainbow-delimiters-depth-4">(</span>intern skeleton-chosen<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>define-key html-mode-map <span class="org-string">"\C-ct"</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">insert-django-skeleton</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">visit-parent-django-template</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"In a buffer containg {% extends \"foo.html\" %}, visit foo.html."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span>start-pos end-pos template-name<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">save-excursion</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>widen<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>goto-char <span class="org-rainbow-delimiters-depth-5">(</span>point-min<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Find the extends tag</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>not <span class="org-rainbow-delimiters-depth-6">(</span>looking-at <span class="org-string">"{% ?extends"</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>forward-char 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Find the opening " of the file name.</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>not <span class="org-rainbow-delimiters-depth-6">(</span>looking-at <span class="org-string">"\""</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>forward-char 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span>forward-char<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> start-pos <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>

      <span class="org-comment-delimiter">;; </span><span class="org-comment">Find the closing "</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-5">(</span>not <span class="org-rainbow-delimiters-depth-6">(</span>looking-at <span class="org-string">"\""</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
        <span class="org-rainbow-delimiters-depth-5">(</span>forward-char 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> end-pos <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>

      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> template-name <span class="org-rainbow-delimiters-depth-5">(</span>buffer-substring-no-properties start-pos end-pos<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Open this file, assuming it's in the same directory.</span>
    <span class="org-comment-delimiter">;; </span><span class="org-fic">TODO</span><span class="org-comment">: Search the current VCS checkout for it.</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>find-file template-name<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">html-linkify-region</span> <span class="org-rainbow-delimiters-depth-2">(</span>url<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Wraps the region in an &lt;a&gt; tag with href set to URL."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-string">"sURL: "</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-3">(</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>initial-cursor-position <span class="org-rainbow-delimiters-depth-5">(</span>point<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>beginning <span class="org-rainbow-delimiters-depth-5">(</span>region-beginning<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>end <span class="org-rainbow-delimiters-depth-5">(</span>region-end<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>first-replacement <span class="org-rainbow-delimiters-depth-5">(</span>concat <span class="org-string">"&lt;a href=\""</span> url <span class="org-string">"\"&gt;"</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>second-replacement <span class="org-string">"&lt;/a&gt;"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>goto-char beginning<span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>insert first-replacement<span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>goto-char <span class="org-rainbow-delimiters-depth-4">(</span>+ end <span class="org-rainbow-delimiters-depth-5">(</span>length first-replacement<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>insert second-replacement<span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>goto-char <span class="org-rainbow-delimiters-depth-4">(</span>+ initial-cursor-position <span class="org-rainbow-delimiters-depth-5">(</span>length first-replacement<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">; </span><span class="org-comment">zen coding: converts selector-style lines to tags</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">e.g. table&gt;tr*2 becomes &lt;table&gt;&lt;tr&gt;&lt;/tr&gt;&lt;tr&gt;&lt;/tr&gt;&lt;/table&gt;</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">zencoding-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sgml-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">zencoding-mode</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-start on any markup modes</span>
</pre>
</div>
</div>
</div>
