init.org
** CSS

Typically I work on projects that use 4 spaces for CSS indenetation.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'css-mode-hook
            (function
             (lambda ()
               (progn
                 (setq css-indent-offset 4)
                 (setq indent-tabs-mode nil)))))
#+END_SRC
   
It's really handy to highlight CSS colour values to show the colour
they represent.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'css-mode-hook 'rainbow-mode)
#+END_SRC

Smartparens is well suited to CSS too, to automatically pair up curly
brackets.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'css-mode-hook #'smartparens-strict-mode)
#+END_SRC

Highlight symbols, so we can see repeated tag names and classes.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'css-mode-hook #'highlight-symbol-mode)
#+END_SRC

Company does a great job with completion for CSS, so use it here.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'css-mode-hook #'company-mode)
#+END_SRC

I often toggle =!important= when editing, so define a keybinding
for this.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'css-mode)
  (define-key css-mode-map (kbd "C-c i") #'emr-css-toggle-important)
#+END_SRC

** Less (CSS)

The less compiler doesn't give much feedback, but it does gives us a
syntax check.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'less-css-mode)
  (add-hook 'less-css-mode-hook 'flymake-mode)
#+END_SRC

** Org-mode

We often use code snippets in org-mode files, so syntax highlight
them.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq org-src-fontify-natively t)
#+END_SRC

** Markdown

Markdown is essentially prose, so it's nice to automatically line-wrap
(by inserting newlines) as we type.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'markdown-mode-hook 'auto-fill-mode)
#+END_SRC
   
** Performance

Emacs will run garbage collection after ~gc-cons-threshold~ bytes of
consing. The default value is 800,000 bytes, or ~ 0.7 MiB. By
increasing to 10 MiB we reduce the number of pauses due to garbage collection.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq gc-cons-threshold (* 10 1024 1024))
#+END_SRC

** Shut Down

I rarely close Emacs, but using Zile means I use =C-x C-c= a lot. It's
annoying to accidentally close Emacs, so warn first.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq confirm-kill-emacs #'y-or-n-p)
#+END_SRC

** Workarounds

Don't try to reopen all files that are owned by other users.
https://github.com/bbatsov/crux/issues/20

#+BEGIN_SRC emacs-lisp :tangle yes
  (remove-hook 'find-file-hook #'crux-reopen-as-root)
#+END_SRC

