init.html

<div id="outline-container-org4b1f8bb" class="outline-3">
<h3 id="org4b1f8bb"><span class="section-number-3">3.17</span> CSS</h3>
<div class="outline-text-3" id="text-3-17">
<p>
Typically I work on projects that use 4 spaces for CSS indenetation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css-mode-hook</span>
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">function</span>
           <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-4">()</span>
             <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">progn</span>
               <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> css-indent-offset 4<span class="org-rainbow-delimiters-depth-5">)</span>
               <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> indent-tabs-mode nil<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
It's really handy to highlight CSS colour values to show the colour
they represent.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">rainbow-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Smartparens is well suited to CSS too, to automatically pair up curly
brackets.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">smartparens-strict-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Highlight symbols, so we can see repeated tag names and classes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">highlight-symbol-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Company does a great job with completion for CSS, so use it here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">css-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">company-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
I often toggle <code>!important</code> when editing, so define a keybinding
for this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">css-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>define-key css-mode-map <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-c i"</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">emr-css-toggle-important</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga429344" class="outline-3">
<h3 id="orga429344"><span class="section-number-3">3.18</span> Less (CSS)</h3>
<div class="outline-text-3" id="text-3-18">
<p>
The less compiler doesn't give much feedback, but it does gives us a
syntax check.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">less-css-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">less-css-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flymake-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0123582" class="outline-3">
<h3 id="org0123582"><span class="section-number-3">3.19</span> Org-mode</h3>
<div class="outline-text-3" id="text-3-19">
<p>
We often use code snippets in org-mode files, so syntax highlight
them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-src-fontify-natively t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4be9d65" class="outline-3">
<h3 id="org4be9d65"><span class="section-number-3">3.20</span> Markdown</h3>
<div class="outline-text-3" id="text-3-20">
<p>
Markdown is essentially prose, so it's nice to automatically line-wrap
(by inserting newlines) as we type.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">markdown-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-fill-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd66e48c" class="outline-3">
<h3 id="orgd66e48c"><span class="section-number-3">3.21</span> Performance</h3>
<div class="outline-text-3" id="text-3-21">
<p>
Emacs will run garbage collection after <code>gc-cons-threshold</code> bytes of
consing. The default value is 800,000 bytes, or ~ 0.7 MiB. By
increasing to 10 MiB we reduce the number of pauses due to garbage collection.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> gc-cons-threshold <span class="org-rainbow-delimiters-depth-2">(</span>* 10 1024 1024<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab28e09" class="outline-3">
<h3 id="orgab28e09"><span class="section-number-3">3.22</span> Shut Down</h3>
<div class="outline-text-3" id="text-3-22">
<p>
I rarely close Emacs, but using Zile means I use <code>C-x C-c</code> a lot. It's
annoying to accidentally close Emacs, so warn first.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> confirm-kill-emacs <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">y-or-n-p</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f8adb6" class="outline-3">
<h3 id="org7f8adb6"><span class="section-number-3">3.23</span> Workarounds</h3>
<div class="outline-text-3" id="text-3-23">
<p>
Don't try to reopen all files that are owned by other users.
<a href="https://github.com/bbatsov/crux/issues/20">https://github.com/bbatsov/crux/issues/20</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>remove-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">find-file-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">crux-reopen-as-root</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
