init.org
** Undocumented

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'ui-customisations)

  (require 'file-customisations)
  (require 'movement-customisations)
  (require 'editing-customisations)
  (require 'kill-ring-customisations)

  (if (eq system-type 'darwin)
      (require 'os-x-fixes))

  (require 'minibuffer-completion-customisations)

  ;; make re-builder use the same regexp format as regexp-replace (no double escaping)
  (setq reb-re-syntax 'string)

  ;; treat space charcters as matching space characters, not like PCRE's '\s+'
  (setq search-whitespace-regexp nil)

  (require 'completion-customisations)
  (require 'snippet-customisations)
  (require 'structured-text-customisations)
  (require 'isearch-customisations)
  (require 'projectile-customisations)

  (require 'go-customisations)
  (require 'c-customisations)
  (require 'asm-customisations)
  (require 'coffee-customisations)
  (require 'javascript-customisations)
  (require 'lisp-customisations)
  (require 'makefile-customisations)
  (require 'python-customisations)
  (require 'rust-customisations)
  (require 'llvm-customisations)
  (require 'sh-customisations)
  (require 'xml-customisations)
  (require 'html-customisations)

  (require 'startup-customisations)

  (require 'git-customisations)
  (require 'irc-customisations)
  (require 'eshell-customisations)

  (require 'compilation-customisations)

  (ignore-errors (require 'site-customisations))

  (setq ag-highlight-search 't)
  (global-set-key (kbd "<f5>") #'ag-project)

  ;; stolen from http://whattheemacsd.com/setup-dired.el-02.html
  (defun dired-back-to-top ()
    (interactive)
    (beginning-of-buffer)
    (dired-next-line (if dired-omit-mode 2 4)))

  (define-key dired-mode-map
    (vector 'remap 'beginning-of-buffer) 'dired-back-to-top)

  (defun dired-jump-to-bottom ()
    (interactive)
    (end-of-buffer)
    (dired-next-line -1))

  (define-key dired-mode-map
    (vector 'remap 'end-of-buffer) 'dired-jump-to-bottom)

  (require 'conflicts-customisations)
  (require 'org-customisations)

  (require 'tags-customisations)

  (require 'blog-utils)

  ;; crontab mode for files named
  (require 'crontab-mode)
  (add-to-list 'auto-mode-alist '("crontab.*?\\'" . crontab-mode))

  (setq ring-bell-function 'ignore)

  ;; suspend seems to crash on Gnome 3, and I don't use it anyway, so just disable it
  (setq cannot-suspend t)
  (defun suspend-emacs (&rest)
    (interactive))
  (defun suspend-frame (&rest)
    (interactive))

  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(frame-background-mode (quote dark))
   '(safe-local-variable-values
     (quote
      ((eval font-lock-add-keywords nil
             (\`
              (((\,
                 (concat "("
                         (regexp-opt
                          (quote
                           ("sp-do-move-op" "sp-do-move-cl" "sp-do-put-op" "sp-do-put-cl" "sp-do-del-op" "sp-do-del-cl"))
                          t)
                         "\\_>"))
                1
                (quote font-lock-variable-name-face)))))))))
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(ahs-plugin-defalt-face ((t nil)))
   '(ethan-wspace-face ((t (:background "#2e3434"))))
   '(flymake-errline ((((class color)) (:underline "Red"))))
   '(flymake-warnline ((((class color)) (:underline "Orange"))))
   '(highlight-symbol-face ((t (:underline t))))
   '(hl-line ((t (:background "gray14"))))
   '(hl-sexp-face ((t (:background "gray14"))))
   '(js2-function-param-face ((((class color)) (:foreground "Green"))))
   '(org-level-1 ((t (:foreground "dodger blue" :weight bold :height 1.0))))
   '(org-level-2 ((t (:foreground "#edd400" :weight bold :height 1.0))))
   '(smerge-refined-change ((t (:background "black")))))

  (put 'narrow-to-region 'disabled nil)

  (defun indent-buffer ()
    "Indent the everything in the current buffer."
    (interactive)
    (indent-region (point-min) (point-max)))

  (require 'f)
  (require 's)

  (defun wh/download-file (url directory file-name)
    "Download the file at URL into DIRECTORY.
  The FILE-NAME defaults to the one used in the URL."
    (interactive
     ;; We're forced to let-bind url here since we access it before
     ;; interactive binds the function parameters.
     (let ((url (read-from-minibuffer "URL: ")))
       (list
        url
        (read-directory-name "Destination dir: ")
        ;; deliberately not using read-file-name since that inludes the directory
        (read-from-minibuffer
         "File name: "
         (car (last (s-split "/" url)))))))
    (let ((destination (f-join directory file-name)))
      (url-copy-file url destination 't)
      (find-file destination)))

  (setq-default dired-listing-switches "-alhv")

  (global-anzu-mode +1)

  (require 'diminish)
  (diminish 'anzu-mode)
  (put 'dired-find-alternate-file 'disabled nil)

  ;; There are a few applications, such as crontab, that require a
  ;; trailing new line. To be safe, always leave a trailing newline.
  (setq-default require-final-newline t)

  ;; cycle through amounts of spacing
  ;; http://pragmaticemacs.com/emacs/cycle-spacing/
  (global-set-key (kbd "M-SPC") #'cycle-spacing)

  (use-package twittering-mode
    :init
    ;; Don't show the twitter client or location, it's just distracting.
    (setq twittering-status-format "%i %s,  %@:\n%FILL[  ]{%T %r%R}\n "))

  (defun font-size-for-demos ()
    "Increase font size everywhere.
  Really handy when doing Emacs demos on projectors."
    (set-face-attribute 'default (selected-frame) :height 120))
#+END_SRC
